In [16]:
##############
#     SQL    #
##############

#Task1
import sqlite3
conn = sqlite3.connect('week1.db')

In [17]:
import pandas as pd
data = pd.read_sql_query('SELECT * FROM CITY;', conn)
data.head()

     ID          NAME COUNTRYCODE DISTRICT  POPULATION
0  1661         Hanoi          HN    NORTH     8000000
1  1662   Ho Chi Minh         HCM     EAST    13000000
2  1663      New York         USA     EAST    13000000
3  1663      Wasinton         USA     EAST    14000000
4  1663  San Fransico         USA     EAST    10000000

In [ ]:
#Task 2
data = pd.read_sql_query('SELECT * FROM CITY WHERE COUNTRYCODE Like "USA" AND POPULATION > 10000000;', conn)
data.head()

     ID      NAME COUNTRYCODE DISTRICT  POPULATION
0  1663  New York         USA     EAST    13000000
1  1663  Wasinton         USA     EAST    14000000

In [ ]:
#Task 3
data = pd.read_sql_query('SELECT * FROM CITY WHERE COUNTRYCODE = "JPN";', conn)
data.head()

     ID   NAME COUNTRYCODE DISTRICT  POPULATION
0  1664  TOKYO         JPN     EAST    10000000
1  1664  OSAKA         JPN     EAST     9000000

In [ ]:
#Task 4
data = pd.read_sql_query('SELECT CITY.NAME FROM CITY WHERE COUNTRYCODE = "JPN";', conn)
data.head()

    NAME
0  TOKYO
1  OSAKA

In [ ]:
#Task 5
data = pd.read_sql_query('SELECT STATION.CITY, STATION.STATE FROM STATION;', conn)
data.head()

       CITY    STATE
0  New York  America
1   Chicago      USA
2  San Jose      USA

In [ ]:
#Task 6
data = pd.read_sql_query('SELECT STATION.CITY FROM STATION GROUP BY STATION.CITY ORDER BY STATION.ID DESC;', conn)
data.head()

       CITY
0  New York
1   Chicago
2  San Jose

In [ ]:
#Task 7
data = pd.read_sql_query('SELECT STATION.CITY, COUNT(STATION.CITY) AS COUNT FROM STATION GROUP BY STATION.CITY ORDER BY STATION.ID DESC;', conn)
data.head()

       CITY  COUNT
0  New York      2
1   Chicago      1
2  San Jose      1

In [ ]:
data = pd.read_sql_query('SELECT COUNT(*) AS COUNT_CITY FROM (SELECT STATION.CITY FROM STATION GROUP BY STATION.CITY);', conn)
data.head()

   COUNT_CITY
0           3

In [ ]:
#Task 8
data = pd.read_sql_query('SELECT STATION.CITY FROM STATION WHERE STATION.CITY LIKE "S%" OR STATION.CITY LIKE "E%" GROUP BY STATION.CITY;', conn)
data.head()

       CITY
0  San Jose

In [ ]:
#Task 9
data = pd.read_sql_query('SELECT STATION.CITY FROM STATION WHERE STATION.CITY LIKE "%e" OR STATION.CITY LIKE "%o" GROUP BY STATION.CITY;', conn)
data.head()

       CITY
0   Chicago
1  San Jose

In [ ]:
#Task 10
data = pd.read_sql_query('SELECT STATION.CITY FROM STATION WHERE STATION.CITY LIKE "%e%" OR STATION.CITY LIKE "%o%" GROUP BY STATION.CITY;', conn)
data.head()

       CITY
0   Chicago
1  New York
2  San Jose

In [25]:
#################
#     PYTHON    #
#################

#Task 1
if __name__ == '__main__':
    n = int(input())
    if (n%2 != 0) or (n%2 == 0 and n > 6 and n < 20):
      print("Weird")
    if n%2 == 0 and ((n > 2 and n < 5) or n > 20) :
      print("Not weird")

3
Weird

In [27]:
#Task 2
if __name__ == '__main__':
    a = int(input())
    b = int(input())
    print("SUM: ", a+b)
    print("DIFFERENCE: ", a-b)
    print("PRODUCT: ", a*b)

3
2
SUM:  5
DIFFERENCE:  1
PRODUCT:  6

In [31]:
#Task 3
if __name__ == '__main__':
    while True:
      n = int(input())
      if n < 0:
        print("n must be greater than 0")
        continue
      else:
        break
    print("RESULT: ", n*n)

-4
n must be greater than 0
3
RESULT:  9

In [35]:
#Task 4
import math
def is_leap(year):
  if (year % 4) == 0:
   if (year % 100) == 0:
       if (year % 400) == 0:
           return True
       else:
           return False
   else:
       return True
  return False

if __name__ == '__main__':
  while True:
      year = int(input())
      if year < 1900 or year > pow(100, 5):
        print("Enter year greater than 1900 and less than 10000")
        continue
      else:
        break
  if is_leap(year):
    print("{0} is a leap year".format(year))
  else: 
    print("{0} is not a leap year".format(year))

2000
2000 is a leap year

In [42]:
#Task 5
if __name__ == '__main__':
  n = int(input())
  a = []
  sum = 0
  for i in range(n):
    a.append(int(input()))
  print("-------")
  a.sort()
  print("runner_up is people has index", a[n-2])

4
5
3
1
4
-------
runner_up is people has index 4